<div id="bmi">
   <div id="formBMI">
    <label>น้ำหนัก :</label>
    <input type="text" name="weight" value="" class="weight" maxlength="3">
    <label>กิโลกรัม</label><br>
    <label style="margin-left:1px;">ส่วนสูง :</label>
    <input type="text" name="height" value="" class="height" maxlength="3">
    <label>เซ็นติเมตร</label>
   <button type="button" value="" class="btn-bmi" ></button>
  <div class="alert alert-warning hide result" style="margin-top:10px;">
  	<span class="label label-warning"> ค่า bmi</span> <span class="ans"></span></div>
  </div>
</div>

<div style="display:none" >
<div id="result1"  class="result">
	<div style="margin-bottom: 10px;">
		<p class="titleBlank ">ค่ามาตรฐานและการแปลผล  ค่า BMI = <span class="bmi-value"></span></p>
		<div class="line5"></div>
		<p class="title-news" style="margin-top:10px;"> "น้ำหนักน้อย/ผอม "</p>
	</div>

	<div class="alert alert-success">
	<p class="text-info text-center"  style="margin-left:10px;">มีน้ำหนักน้อยหรือผอม โดยทั่วไป ค่าดัชนีมวลกายปกติมีค่าระหว่าง 18.5 - 22.9</p>
	<span class="label label-success">ข้อแนะนำ</span>
	<ol>
		<li class="text-muted">ควรกินอาหารให้หลากหลายครบ 5 หมู่ในสัดส่วนที่เหมาะสมและปริมาณมากขึ้น โดยเพิ่มอาหารประเภทที่ให้พลังงานมากขึ้น เช่น ไขมัน แป้ง ข้าว เนื้อสัตว์ นม</l>
		<li class="text-muted">ควรเคลื่อนไหวและออกกำลังกายอย่างสม่ำเสมอทุกวันหรือเกือบทุกวัน ให้เหนื่อยพอควรโดยหายใจกระชั้นขึ้น เช่น เดินเร็ว ถีบจักรยาน รำมวยจีน ลีลาศจังหวะช้า รวมทั้งงานบ้าน งานสวน เป็นต้น สะสมให้ได้อย่างน้อยวันละ 30 นาทีอาจไม่จำเป็นต้องออกกำลังกายให้เหนื่อยมากหรือหอบ ที่ง่ายที่สุดคือ การเดิน</li>
	</ol>
	</div>
	<div class="tomatoes"></div>
</div>

<div id="result2"  class="result">
	<div style="margin-bottom: 10px;">
		<p class="titleBlank">ค่ามาตรฐานและการแปลผล  ค่า BMI = <span class="bmi-value"></span></p>
		<div class="line5"></div><p class="title-news" style="margin-top:10px;"> "น้ำหนักปกติ "</p>

	</div>

	<div class="alert alert-success">
	<p class="text-info text-center"  style="margin-left:10px;">ท่านมี น้ำหนักปกติ โดยทั่วไปค่าดัชนีมวลกายปกติมีค่าระหว่าง 18.5 - 22.9 </p>
	<span class="label label-success">ข้อแนะนำ</span>
	<ol>
		<li class="text-muted">ควรกินอาหารให้หลากหลายครบ 5 หมู่ในสัดส่วนที่เหมาะสม กินเท่าที่ร่างกายต้องการวันไหนกินมากเกินไป วันต่อมาก็กินลดลง กินอาหารพวกข้าวและแป้งรวมทั้งเมล็ดธัญพืชอื่น ๆ ให้มากขึ้นไม่น้อยกว่าวันละ 6 ทัพพี กินผัก รวมทั้งเมล็ดถั่ว ผลไม้ ไม่ต่ำกว่าวันละ 5 ส่วน หรือครึ่งกิโลกรัม เพื่อไม่ให้มีพลังงานส่วนเกินจะทำให้ควบคุมน้ำหนักได้ดีและสมดุล</li>
		<li class="text-muted">ควรเคลื่อนไหวและออกกำลังกายอย่างสม่ำเสมอทุกวัน หรือเกือบทุกวัน อย่างน้อยให้เหนื่อยพอควร โดยหายใจกระชั้นขึ้น สะสมให้ได้อย่างน้อยวันละ 30 นาที โดยอาจจะแบ่งเป็น 2-3 ครั้งก็ได้ จะเป็นกิจกรรมออกกำลังกายที่เป็นเรื่องเป็นราวหรือการออกแรงในกิจวัตรประจำวัน เช่นเดินเร็ว ถีบจักรยาน ลีลาศ หรืองานบ้าน งานสวน ให้เลือกทำตามใจชอบ ถ้าท่านต้องการมีสมรรถภาพที่ดีก็ต้องออกกำลังกายแบบแอโรบิก เช่น เดินเร็ว ๆ วิ่งเหยาะ ถีบจักรยานเร็วๆ กระโดดเชือก ว่ายน้ำ เล่นกีฬา เป็นต้น ให้รู้สึกเหนื่อยมาก หรือหอบ อย่างน้อยวันละ 20-30 นาที อย่างน้อยสัปดาห์ละ 3 วัน ที่ง่าย ที่สุดคือ การเดิน</li>
	</ol>
	</div>
	<div class="tomatoes"></div>
</div>

<div id="result3"  class="result">
	<div style="margin-bottom: 10px;">
		<p class="titleBlank">ค่ามาตรฐานและการแปลผล  ค่า BMI = <span class="bmi-value"></span> </p>
		<div class="line5"></div>
		<p class="title-news" style="margin-top:10px;"> "น้ำหนักเกิน/รูปร่างท้วม "</p>
	</div>
	<div class="alert alert-success">
	<p class="text-info text-center" style="margin:5px 10px;">ท่านมี น้ำหนักเกิน หรือรูปร่างท้วม โดยทั่วไปค่าดัชนีมวลกายมีค่าไม่เกิน 22.9</p>
	<span class="label label-success">ข้อแนะนำ</span>
	<ol>
		<li class="text-muted">ควรควบคุมอาหาร โดยลดปริมาณอาหารหรือปรับเปลี่ยนอาหารจากที่ให้พลังงานมากเป็นอาหารที่ให้พลังงานน้อย ทั้งนี้พลังงานที่ได้รับไม่ควรต่ำกว่า 1200 กิโลแคลอรีต่อวัน โดยลดอาหารไขมัน/ เนื้อสัตว์ อาหารผัด/ทอด ขนมหวาน เครื่องดื่มที่ใส่น้ำตาล แอลกอฮอล์ แต่ต้องกินอาหารให้หลากหลายในสัดส่วนที่เหมาะสม กินข้าวและแป้ง รวมทั้งเมล็ดธัญพืชอื่น ๆ ไม่น้อยกว่าวันละ 6 ทัพพี กินผัก รวมทั้งเมล็ดถั่ว ผลไม้ ไม่ต่ำกว่าวันละ 5 ส่วน หรือครึ่งกิโลกรัม เพื่อลดพลังงานเข้า ร่างกายจะได้ใช้พลังงานส่วนเกินที่สะสมอยู่ในรูปไขมันแทน</li>
		<li class="text-muted">ควรเคลื่อนไหวและออกกำลังกายแบบแอโรบิกอย่างสม่ำเสมอทุกวัน หรือเกือบทุกวันอย่างน้อยให้เหนื่อยพอควร โดยหายใจกระชั้นขึ้น สะสมอย่างน้อยวันละ 30 นาที อาจแบ่งเป็นวันละ 2-3 ครั้งก็ได้ เช่น เดินเร็ว ถีบจักรยาน เป็นต้น หากยังไม่เคยออกกำลังกายเริ่มแรกควร ออกกำลังเบา ๆ ที่ง่ายที่สุดคือ การเดิน ใช้เวลาน้อย ๆ ก่อน จากนั้นค่อย ๆ เพิ่มเวลาขึ้นในแต่ละสัปดาห์ โดยยังไม่เพิ่มความหนัก เมื่อร่างกายปรับตัวได้จึงค่อยเพิ่มความหนัก หรือความเหนื่อยตามที่ต้องการ และเพิ่มการเคลื่อนไหวร่างกายให้มากขึ้นในชีวิตประจำวัน เพื่อให้มีการใช้พลังงานเพิ่มขึ้น อย่างน้อยวันละ 200 - 300 กิโลแคลอรี</li>
		<li class="text-muted">ควรฝึกความแข็งแรงของกล้ามเนื้อ ด้วยการฝึกกายบริหารหรือยกน้ำหนัก จะช่วยเสริมให้ร่างกายมีการใช้พลังงานเพิ่มมากขึ้น ทำให้ไขมันลดลง</li>
	</ol>
	</div>
	<div class="tomatoes"></div>
</div>

<div id="result4"  class="result">
	<div style="margin-bottom: 10px;">
		<p class="titleBlank">ค่ามาตรฐานและการแปลผล  ค่า BMI = <span class="bmi-value"></span> </p>
		<div class="line5"></div><p class="title-news" style="margin-top:10px;"> "อ้วนระดับ 1"</p>

	</div>

	<div class="alert alert-success">
	<p class="text-info text-center" style="margin:5px 10px;">ท่าน อ้วนแล้ว (อ้วนระดับ 1) โดยทั่วไปค่าดัชนีมวลกายควรมีค่าไม่เกิน 22.9</p>
	<span class="label label-success">ข้อแนะนำ</span>
	<ol>
		<li class="text-muted">ควรควบคุมอาหารโดยลดปริมาณอาหารหรือปรับเปลี่ยนอาหารจากที่ให้พลังงานมากเป็นอาหารที่ให้พลังงานน้อย ทั้งนี้พลังงานที่ได้รับไม่ควรต่ำกว่า 1200 กิโลแคลอรีต่อวัน โดยลดอาหารไขมัน/เนื้อสัตว์ อาหารผัด/ทอด ขนมหวาน เครื่องดื่มที่ใส่น้ำตาล แอลกอฮอล์ แต่ต้องกินอาหารให้หลากหลายในสัดส่วนที่เหมาะสม กินข้าวและแป้งรวมทั้งเมล็ดธัญพืชอื่น ๆ ไม่น้อยกว่าวันละ 6 ทัพพี กินผักรวมทั้งเมล็ดถั่ว ผลไม้ไม่ต่ำกว่าวันละ 5 ส่วน หรือครึ่งกิโลกรัมเพื่อลดพลังงานเข้า ร่างกายจะได้ใช้พลังงานส่วนเกินที่สะสมอยู่ในรูปไขมันแทน</li>
		<li class="text-muted">ควรเคลื่อนไหวและออกกำลังกายแบบแอโรบิกอย่างสม่ำเสมอทุกวันหรือเกือบทุกวันอย่างน้อยให้เหนื่อยพอควรโดยหายใจกระชั้นขึ้น ประมาณ 40-60 นาทีต่อวัน หรือแบ่งเป็นวันละ 2 ครั้ง ๆ ละ 20-30 นาที เช่น เดินเร็ว ถีบจักรยาน เป็นต้น หากยังไม่เคยออกกำลังกายเริ่มแรก ควรออกกำลังเบา ๆ ที่ง่ายที่สุดคือ การเดิน ใช้เวลาน้อยๆ ก่อน จากนั้น ค่อย ๆ เพิ่มเวลาขึ้นในแต่ละสัปดาห์ โดยยังไม่เพิ่มความหนัก เมื่อร่างกายปรับตัวได้จึงค่อยเพิ่มความหนัก หรือความเหนื่อยตามที่ต้องการและเพิ่มการเคลื่อนไหวร่างกายให้มากขึ้นในชีวิตประจำวัน เพื่อให้มีการใช้พลังงานเพิ่มขึ้น อย่างน้อยวันละ 200 - 300 กิโลแคลอรี </li>
		<li class="text-muted">ควรฝึกความแข็งแรงของกล้ามเนื้อ ด้วยการฝึกกายบริหารหรือยกน้ำหนัก จะช่วยเสริมให้ร่างกายมีการใช้พลังงานเพิ่มมากขึ้น ทำให้ไขมันลดลง</li>
		<li class="text-muted">ถ้าท่านสามารถลดพลังงานเข้าจากอาหารลงได้วันละ 400 กิโลแคลอรี และเพิ่มการใช้ พลังงานจากการออกกำลังกายวันละ 200 กิโลแคลอรี รวมแล้วท่านมีพลังงาพร่องลงไปวันละ 600 กิโลแคลอรี ออกกำลังกายประมาณ 6 วัน คิดเป็นพลังงานพร่อง 3600 กิโลแคลอรี ท่านจะลดไขมันลงได้ประมาณครึ่งกิโลกรัมต่อสัปดาห์ พลังงานเข้าหรือออก 3500 กิโลแคลอรี จะเพิ่มหรือลดไขมันได้ 1 ปอนด์ หรือ 0.45 กิโลกรัม</li>
		<li class="text-muted">ควรปรึกษาแพทย์หรือผู้เชี่ยวชาญในการลดและควบคุมน้ำหนัก</li>
	</ol>
	</div>
	<div class="tomatoes"></div>
</div>


<div id="result5" class="result">
	<div style="margin-bottom: 10px;">
		<p class="titleBlank">ค่ามาตรฐานและการแปลผล  ค่า BMI = <span class="bmi-value"></span></p>
		<div class="line5"></div><p class="title-news" style="margin-top:10px;">  "อ้วนระดับ 2"</p>

	</div>
	<div class="alert alert-success">
		<p class="text-danger text-center" style="margin:5px 10px;">ท่านอ้วนมาก (อ้วนระดับ 2) โดยทั่วไปค่าดัชนีมวลกายควรมีค่าไม่เกิน 22.9 </p>
		<span class="label label-success">ข้อแนะนำ</span>
		<ol>
			<li class="text-muted">ควรควบคุมอาหารโดยลดปริมาณอาหารหรือปรับเปลี่ยนอาหารจากที่ให้พลังงานมากเป็นอาหารที่ให้พลังงานน้อย ทั้งนี้พลังงานที่ได้รับไม่ควรต่ำกว่า 1200 กิโลแคลอรีต่อวัน โดยลดอาหารไขมัน/เนื้อสัตว์ อาหารผัด/ทอด ขนมหวาน เครื่องดื่มที่ใส่น้ำตาล แอลกอฮอล์ แต่ต้องกินอาหารให้หลากหลายในสัดส่วนที่เหมาะสม กินข้าวและแป้งรวมทั้งเมล็ดธัญพืชอื่น ๆ ไม่น้อยกว่าวันละ 6 ทัพพี กินผักรวมทั้งเมล็ดถั่ว ผลไม้ไม่ต่ำกว่าวันละ 5 ส่วน หรือครึ่งกิโลกรัมเพื่อลดพลังงานเข้า ร่างกายจะได้ใช้พลังงานส่วนเกินที่สะสมอยู่ในรูปไขมันแทน</li>
			<li class="text-muted">ควรเคลื่อนไหวและออกกำลังกายแบบแอโรบิกอย่างสม่ำเสมอทุกวันหรือเกือบทุกวันอย่างน้อยให้เหนื่อยพอควรโดยหายใจกระชั้นขึ้น ประมาณ 40-60 นาทีต่อวัน หรือแบ่งเป็นวันละ 2 ครั้ง ๆ ละ 20-30 นาที เช่น เดินเร็ว ถีบจักรยาน เป็นต้น หากยังไม่เคยออกกำลังกายเริ่มแรก ควรออกกำลังเบา ๆ ที่ง่ายที่สุดคือ การเดิน ใช้เวลาน้อยๆ ก่อน จากนั้น ค่อย ๆ เพิ่มเวลาขึ้นในแต่ละสัปดาห์ โดยยังไม่เพิ่มความหนัก เมื่อร่างกายปรับตัวได้จึงค่อยเพิ่มความหนัก หรือความเหนื่อยตามที่ต้องการและเพิ่มการเคลื่อนไหวร่างกายให้มากขึ้นในชีวิตประจำวัน เพื่อให้มีการใช้พลังงานเพิ่มขึ้น อย่างน้อยวันละ 200 - 300 กิโลแคลอรี </li>
			<li class="text-muted">ควรฝึกความแข็งแรงของกล้ามเนื้อ ด้วยการฝึกกายบริหารหรือยกน้ำหนัก จะช่วยเสริมให้ร่างกายมีการใช้พลังงานเพิ่มมากขึ้น ทำให้ไขมันลดลง</li>
			<li class="text-muted">ถ้าท่านสามารถลดพลังงานเข้าจากอาหารลงได้วันละ 400 กิโลแคลอรี และเพิ่มการใช้ พลังงานจากการออกกำลังกายวันละ 200 กิโลแคลอรี รวมแล้วท่านมีพลังงาพร่องลงไปวันละ 600 กิโลแคลอรี ออกกำลังกายประมาณ 6 วัน คิดเป็นพลังงานพร่อง 3600 กิโลแคลอรี ท่านจะลดไขมันลงได้ประมาณครึ่งกิโลกรัมต่อสัปดาห์ พลังงานเข้าหรือออก 3500 กิโลแคลอรี จะเพิ่มหรือลดไขมันได้ 1 ปอนด์ หรือ 0.45 กิโลกรัม</li>
			<li class="text-muted">ควรปรึกษาแพทย์หรือผู้เชี่ยวชาญในการลดและควบคุมน้ำหนัก</li>
		</ol>
	</div>
	<div class="tomatoes"></div>
</div>


</div>

<script type="text/javascript">
$(document).ready(function(){
	var i;
	checkNum('.weight,.height');
	$('.btn-bmi').click(function(){
		var weight = $('input[name=weight]').val();
		var height = $('input[name=height]').val();
		if(weight.length>0 && height.length>0){
			weight = parseInt(weight);
			height = parseInt(height);
			var result = bmi_cal(weight,height);
			switch(result[1]){
				case "ผอม":  i="1";break;
				case "ปกติ":  i="2";break;
				case "ท้วม":  i="3";break;
				case "อ้วน":  i="4";break;
				case "อ้วนมาก": i="5";break;
			}
			$('#result'+i).find('.bmi-value').html(result[0].toFixed(2));
			$.colorbox({href:'#result'+i,inline:true,innerWidth:"100%",innerHeight:"100%",width:"80%",height:"70%"});

		}
	});
});
</script>
