<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
	<base href="<?php echo base_url(); ?>" />
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
	<title><?php echo $template['title'] ?></title>
	<?php include_once("_css.php");?>
	<script type="text/javascript" src="media/js/jquery-1.6.4.min.js"></script>
    <?php echo $template['metadata'] ?>
</head>
<body>
<div class="row" id="bg2-theme">
    <div class="container">
 	<?php include('_header.php'); ?>
	<?php include('_menu.php'); ?>
<!-----------------------Start row3-------------------------------->
	 <div id="row3">
<!---------------------------------------------------------------------Breadcrumbs-------------------------------------------------------------->
     	  <div id="Breadcrumbs">
          	<ol id="path-breadcrumb">
              <li><a href="#">หน้าแรก</a></li>
              <li class="active">ข้อมูลโครงการ</li>
            </ol>
          </div>
<!--------------------------------------------------------------------------BLANK-------------------------------------------------------------->
          <div id="blank">

                <div class="titleBlank">ข้อมูลโครงการ<div class="line5"> </div> </div>
                	<div class="contentBlank">
                    	<div style="text-align:center;"><strong>ขยับองค์กร/ชุมชน สู่ศูนย์การเรียนรู้องค์กรต้นแบบไร้พุง<br />
               	      <br>  เกริ่นนำ</strong>
                    	</div><br />
โครงการคนไทยไร้พุงบริหารจัดการโดยสำนักโภชนาการ กรมอนามัย ดังนี้

<strong><br />
วิสัยทัศน์</strong>
<ol>
   <li>เป็นแกนหลัก การส่งเสริมสุขภาพด้านอาหารและโภชนาการทุกสถานที่ต่างๆ (setting) เพื่อแก้ไขปัญหาโรคอ้วนในคนไทย นำไปสู่การลด
โรคไม่ติดต่อเรื้อรัง เป็นการสนับสนุนการดำเนินงานสร้างสุขภาพและป้องกันโรคตามกลุ่มวัย </li>
    <li>มีมาตรฐาน ด้านการประเมินรับรองการจัดการศูนย์การเรียนรู้องค์กรต้นแบบไร้พุง</li>
    <li>เกิดประโยชน์ เป็นแหล่งรวบรวมข้อมูลความรู้การปรับเปลี่ยนพฤติกรรมสุขภาพ ๓อ. (อาหาร ออกกำลังกาย อารมณ์) การสร้างสภาวะแวดล้อม
ที่เื้อื้อ รวมทั้งมาตรการสังคม เพื่อควบคุมป้องกันภาวะน้ำหนักเกิน และโรคอ้วนให้ภาคีเครือข่ายได้แลกเปลี่ยนเรียนรู้การขับเคลื่อนศูนย์การเรียนรู้
องค์กรต้นแบบไร้พุง</li>
</ol>
<strong>ภารกิจ</strong>
<ol>
    <li>สนับสนุนวิชาการและสิ่งอำนวยความสะดวกต่อการขับเคลื่่อนศูนย์การเรียนรู้องค์กรต้นแบบไร้พุง อย่างมีคุณภาพ </li>
    <li>พัฒนาภาคีเครือข่ายสุขภาพในการรับรู้ข้อมูลและเสนอแนะผลการประเมิน ติดตามศูนย์การเรียนรู้องค์กรต้นแบบไร้พุง ให้เป็นไปอย่างมี
ประสิทธิภาพ </li>
    <li>สร้างความสัมพันธ์อันดี จัดให้มีกิจกรรมร่วมระหว่างภาคีเครือข่าย ศูนย์การเรียนรู้องค์กรต้นแบบไร้พุง </li>
</ol>
<strong>ความมุ่งหวัง</strong>
<p>สำนักโภชนาการมีความมุ่งหวังให้ประชาชนในชุมชนและองค์กรมีพฤติกรรมการบริโภคอาหาร การใช้แรงกายที่เหมาะสม จนสามารถควบคุมน้ำหนัก
ตนเองไม่ให้มีภาวะน้ำหนักเกินและเป็นโรคอ้วน ลดการเกิดโรคที่มีสาเหตุจากความอ้วน ซึ่งส่งผลกระทบโดยตรงถึงค่าใช้จ่ายในการรักษาพยาบาล
รวมทั้งความสูญเสียของเศรษฐกิจจากการขาดงานอันเนื่องมาจากการเจ็บป่วย</p>
<p>สำนักโภชนาการ สนับสนุนการดำเนินการศูนย์การเรียนรู้องค์กรต้นแบบไร้พุง โดยสร้างสรรค์ชุดกิจกรรมที่เกี่ยวข้องให้สมดังคำว่า
"ศูนย์เพื่อการเรียนและรู้"</p>
                    </div>

     	 </div>
	 </div>
<!-----------------------End row3-------------------------------->

	<div class="clearfix"></div>
    </div>
<!-------End container----------->

 <!--------------------------------------------------------------------------Footer------------------------------------------------------------->
<?php include_once('_footer.php'); ?>
</div>
</body>